# DockablePaneId Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneId Constructor
DockablePaneId Class See Also
---
Creates a new DockablePaneId instance.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DockablePaneId(
	Guid guid
)
```

Visual Basic
---
```text
Public Sub New ( _
	guid As Guid _
)
```

Visual C++
---
```text
public:
DockablePaneId(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..GuidThe identifier for the DockablePaneId.
# See Also
DockablePaneId Class
Autodesk.Revit.UI Namespace